app/views/banner/_new_search.html.erb

SELECT "cities".* FROM "cities" WHERE (lower(city_name)='rio vista') ORDER BY "cities"."city_id" DESC LIMIT 1
---
        <div class="cityvalue flex-box <% if chk_curent_user%>input-holder cityvaluebe<%else%>input-holder-beflog<%end%>">
          <% if cookies[:search_city]!='' && cookies[:search_city].present?%>