app/views/cards/_activity_card.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."activity_id" = 3655 LIMIT 1
---
    </div>
    <a <%if a[:status]=="Edit"%>onClick="pop_edit_activity('/edit_activity_parent?activity_id=<%= a[:act].activity_id%>')" href="javascript:void(0);" <%else%><%if !a[:act].purchase_url.nil? && a[:act].purchase_url.present?%>target="_blank" href="<%= purchaselink %>" <%else%> href="<%= activitylink %>"<%end%><%end%> class="card_pay_anchor"><div class="card_pay" onClick="_gaq.push(['_trackEvent', 'Parent Module', 'clickActivityCard', <%= a[:status] %>,'<%= a[:act].activity_id %>']);"><%= a[:status] %></div></a>