app/views/cards/_provider_card.html.erb

SELECT "cities".* FROM "cities" WHERE (lower(city_name)='test') ORDER BY "cities"."city_id" DESC LIMIT 1
---
<%get_city = a[:user_pro].city.downcase.gsub(/\s/,'-') if a[:user_pro].city && !a[:user_pro].city.nil? && a[:user_pro].city.present?%>