app/controllers/home_controller.rb

  def index
    @meta_alt=true  #dont remove, this for sitemap usage
    @fam_city = City.order(:city_name)
---
SELECT "cities".* FROM "cities" WHERE (lower(city_name)='alameda') ORDER BY "cities"."city_id" DESC LIMIT 1