app/controllers/user_profiles_controller.rb

  def fetch_city
    @state_value = params[:state_value].blank? ? false : true
    @city_arr = []
    if(@state_value)
      @cities = City.where("state_id = 1 and country_id = 1").order("city_name Asc")
---
SELECT "cities".* FROM "cities" WHERE (state_id = 1 and country_id = 1) ORDER BY city_name Asc
SELECT COUNT(*) FROM "cities" WHERE (state_id = 1 and country_id = 1)