app/controllers/users_controller.rb

  def curated_user_exist
    #if !current_user.nil? && current_user.present? && !current_user.user_profile.nil? && current_user.user_profile.present?
    #  @user = current_user.user_id
    #  exist_result = 'success'
    #else
    user = User.where('email_address=?',params[:email].downcase).first if !params[:email].nil?
---
SELECT "users".* FROM "users" WHERE (email_address='rajutayaauth@yopmail.com') LIMIT 1

  def provider_sell_submit
    cookies.delete :f_curator
    cookies.delete :f_path
    @partner_reg = params[:partner_reg] #For partner registration
    #checking empty user values start
    if params[:email_old] && !params[:email_old].nil?
      @old_cur=User.where("lower(email_address)=? and user_plan = ?", params[:email_old].downcase,"curator").last if !params[:sell_b_name].nil?
---
SELECT "users".* FROM "users" WHERE (lower(email_address)='' and user_plan = 'curator') ORDER BY "users"."user_id" DESC LIMIT 1

                end
                @u_success=true
                #provider transaction details started stored user information after success or failure
                ProviderTransactionLog.create(:email_address=>@user.email_address,:amount=>@usr_tran_amt, :action_type=>"become_provider", :customer_payment_profile_id=>pay_profile.params["customer_payment_profile_id"], :customer_profile_id=>create_profile.authorization, :inserted_date=>Time.now, :modified_date=>Time.now, :payment_date=>Time.now, :payment_message=>"#{response.message}", :payment_status=>"success", :transaction_id=>provider_trans_id, :user_id=>@user.user_id) if @user && @user.email_address
---
INSERT INTO "provider_transaction_logs" ("action_type", "amount", "customer_payment_profile_id", "customer_profile_id", "email_address", "inserted_date", "modified_date", "payment_date", "payment_message", "payment_status", "transaction_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"